# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'GOOG':[1000,200,np.nan],
                  'FB':[5000,np.nan,np.nan],
                  'AMZN':[10000,250,3000]})

In [3]:
df

     GOOG      FB   AMZN
0  1000.0  5000.0  10000
1   200.0     NaN    250
2     NaN     NaN   3000

In [4]:
df.dropna()

     GOOG      FB   AMZN
0  1000.0  5000.0  10000

In [5]:
df.dropna(axis=1)

    AMZN
0  10000
1    250
2   3000

In [6]:
df.dropna(thresh=2)

     GOOG      FB   AMZN
0  1000.0  5000.0  10000
1   200.0     NaN    250

In [7]:
df.fillna(value='FILL VALUE')

         GOOG          FB   AMZN
0        1000        5000  10000
1         200  FILL VALUE    250
2  FILL VALUE  FILL VALUE   3000

In [8]:
df['GOOG'].fillna(value=df['GOOG'].mean())

0    1000.0
1     200.0
2     600.0
Name: GOOG, dtype: float64